## Auto Scaling

スケールアップ・ダウンを自動化する

### 概要

`Cloud Watch`を使い、トラフィックを監視することができるが、Cloud Watchではスケーリングをすることができない

`Auto Scaling`を使ってスケールアウト（インスタンスを作成して増やす）とスケール員（インスタンスを削除する）を行うことができる

起動設定としてAMI（Amazon Machine Image）やインスタンスタイプ・セキュリティルールなどを設定しておく

Auto ScalingグループでVPCとサブネット・ロードバランサ・などスケーリングの対象と最小インスタンス数や必要なキャパシティーを設定する

Auto Scalingポリシーで、スケジュール（いつ）を設定する

### デモ

コンソールからEC2を選択する

左のメニューのAutoScalingを選択、Create

Launch Configration でAMIとインスタンスタイプ・セキュリティルールを選択し、作成

左のメニューからスケーリンググループを選択し、作成する

スケーリングポリシーで最小インスタンス数・最大インスタンス数を選択する

DetailsタブのEditからインスタンス数を変更できる

例えば２個から４個に変更すると、自動で４つのインスタンスが生成されていることを確認できる

